set names utf8;
drop database if exists Lifeweek;
create database Lifeweek charset = utf8;
use Lifeweek;

create table users (
	user_id int primary key auto_increment, #用户id
	uname varchar(20),   #用户姓名
	email varchar(32),  #用户邮箱
	upwd varchar(20),   #用户密码
	#phone char(11) DEFAULT NULL,#用户手机号
	#user_name varchar(16), # 用户真实姓名
	ustatus tinyint default 0#用户登录状态  0 是未登录  1 是登录
);

create table shopping(
     sid int primary key auto_increment, #购物车编号
		 user_id int ,#用户id
		 product_id int,  #商品id
		 count int default 1 #商品数量
		 
);



insert  into users values(null,"yangshuang","1876484@qq.com","123456",0),
						 (null,"yangfan","1876484@qq.com","123456",0),
						 (null,"yangzeng","1876484@qq.com","123456",0),
						 (null,"yangli","1876484@qq.com","123456",0);
	
	
	
	create table  categorys(
	    id int primary key auto_increment,
		category_id int, #商品分类id 
		cname char(10)   #商品分类名字 
		
	);
	
insert into categorys values(null,101,"三联生活周刊"),	
							   (null,102,"新知"),
							   (null,103,"爱乐"),
							   (null,104,"图书文丛"),
							   (null,105,"杂志订阅");
							   
create table product(
	id int primary key auto_increment,
	product_id int,  #商品id
	title varchar(30), #商品标题
	price decimal(7,2),#原始商品价格
	preferential_price decimal(7,2),#商品优惠价格
	pic varchar(50),#商品图片
	category_id int, #商品分类id
	category varchar(10), #商品热门分类  
	details varchar(300) #商品描述
	
);


insert into product values(null,10001,"20年第29期1096 什么是好的语文教育",15,15,"img/974_thumb_G_1594756622108.jpg",101,"新品上市","目录|封面故事|国漫新生，年轻的想象|动画教给我们的自由|38 槐佳佳：那些年，为《大理寺日志》吃的苦|46 刘健，独立动画的坚持|54 刘阔：选择梦想还是现实？|62 黄成希：“火影”少年的逐梦之旅|70 寻找“国漫之父”|80 80年代，我们爱上的国产动画|86 杭州是如何成为“中国动漫之都”的？|社会|94 热点：冕宁大水后的山民和村庄|100 热点：夏季洪涝灾害为何屡治不绝？|106 专访：吴蛮：寻找琵琶的“世界语言”|经济|92 市场分析：住房公积金制度改革何去何从？|文化"),
						  (null,10002,"20年第28期1095 动画教给我们的自由",30,30,"img/974_thumb_G_1594756622108.jpg",102,"新品上市","目录|封面故事|国漫新生，年轻的想象|动画教给我们的自由|38 槐佳佳：那些年，为《大理寺日志》吃的苦|46 刘健，独立动画的坚持|54 刘阔：选择梦想还是现实？|62 黄成希：“火影”少年的逐梦之旅|70 寻找“国漫之父”|80 80年代，我们爱上的国产动画|86 杭州是如何成为“中国动漫之都”的？|社会|94 热点：冕宁大水后的山民和村庄|100 热点：夏季洪涝灾害为何屡治不绝？|106 专访：吴蛮：寻找琵琶的“世界语言”|经济|92 市场分析：住房公积金制度改革何去何从？|文化"),
						  (null,10003,"《读书》+《爱乐》2020年全年订阅",25,25,"img/974_thumb_G_1594756622108.jpg",101,"编辑推荐","目录|封面故事|国漫新生，年轻的想象|动画教给我们的自由|38 槐佳佳：那些年，为《大理寺日志》吃的苦|46 刘健，独立动画的坚持|54 刘阔：选择梦想还是现实？|62 黄成希：“火影”少年的逐梦之旅|70 寻找“国漫之父”|80 80年代，我们爱上的国产动画|86 杭州是如何成为“中国动漫之都”的？|社会|94 热点：冕宁大水后的山民和村庄|100 热点：夏季洪涝灾害为何屡治不绝？|106 专访：吴蛮：寻找琵琶的“世界语言”|经济|92 市场分析：住房公积金制度改革何去何从？|文化"),
						  (null,10004,"《读书》2020年全年订阅",50,50,"img/974_thumb_G_1594756622108.jpg","101","编辑推荐","目录|封面故事|国漫新生，年轻的想象|动画教给我们的自由|38 槐佳佳：那些年，为《大理寺日志》吃的苦|46 刘健，独立动画的坚持|54 刘阔：选择梦想还是现实？|62 黄成希：“火影”少年的逐梦之旅|70 寻找“国漫之父”|80 80年代，我们爱上的国产动画|86 杭州是如何成为“中国动漫之都”的？|社会|94 热点：冕宁大水后的山民和村庄|100 热点：夏季洪涝灾害为何屡治不绝？|106 专访：吴蛮：寻找琵琶的“世界语言”|经济|92 市场分析：住房公积金制度改革何去何从？|文化"),
						  (null,10005,"20年第29期1096 什么是好的语文教育",15,15,"img/974_thumb_G_1594756622108.jpg",104,"热销商品","目录|封面故事|国漫新生，年轻的想象|动画教给我们的自由|38 槐佳佳：那些年，为《大理寺日志》吃的苦|46 刘健，独立动画的坚持|54 刘阔：选择梦想还是现实？|62 黄成希：“火影”少年的逐梦之旅|70 寻找“国漫之父”|80 80年代，我们爱上的国产动画|86 杭州是如何成为“中国动漫之都”的？|社会|94 热点：冕宁大水后的山民和村庄|100 热点：夏季洪涝灾害为何屡治不绝？|106 专访：吴蛮：寻找琵琶的“世界语言”|经济|92 市场分析：住房公积金制度改革何去何从？|文化"),
						  (null,10006,"20年第29期1096 什么是好的语文教育",15,15,"img/974_thumb_G_1594756622108.jpg",101,"热销商品","目录|封面故事|国漫新生，年轻的想象|动画教给我们的自由|38 槐佳佳：那些年，为《大理寺日志》吃的苦|46 刘健，独立动画的坚持|54 刘阔：选择梦想还是现实？|62 黄成希：“火影”少年的逐梦之旅|70 寻找“国漫之父”|80 80年代，我们爱上的国产动画|86 杭州是如何成为“中国动漫之都”的？|社会|94 热点：冕宁大水后的山民和村庄|100 热点：夏季洪涝灾害为何屡治不绝？|106 专访：吴蛮：寻找琵琶的“世界语言”|经济|92 市场分析：住房公积金制度改革何去何从？|文化");
								
								
	insert into shopping values(null,1,10001,1),
															(null,1,10002,2),
															(null,1,10003,3);
															
